УТ_для_edt.РасширениеСмарт/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтавкиНДС</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>БезНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НДС18</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НДС0</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Enums/ТипыНалогообложенияНДС/ТипыНалогообложенияНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыНалогообложенияНДС</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ПродажаНеОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПродажаНаЭкспорт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяЕНВД</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НалоговыйАгентПоНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОблагаетсяНДСУПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВводОСВЭксплуатацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Товар</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>МногооборотнаяТара</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Работа</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Набор</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/CommonModules/УчетНДСУПСлужебный/Module.bsl
#Область ПеренесеноСДоработками

&ИзменениеИКонтроль("ВыбратьСтавкуНДСРасчетную")
Процедура смарт_ВыбратьСтавкуНДСРасчетную(Запрос, ПолеСтавки)

	ТекстШаблон = СтрШаблон("ВЫБОР
	|		КОГДА %1 = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20_120)
	|		КОГДА %1 = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118)
	|		КОГДА %1 = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
	#Вставка
	//++ #1744 смарт: Шляпников 19.12.2024 / УТ. Добавить ставки НДС 5% и 7%
	|		КОГДА %1 = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5_105)
	|		КОГДА %1 = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7_107)
	//-- #1744 смарт: Шляпников 19.12.2024
	//++ #4804 смарт: Тимофеева 12.11.2025 / Добавить ставку НДС22
	|		КОГДА %1 = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22_122)
	//-- #4804 смарт: Тимофеева 12.11.2025
	#КонецВставки
	|		ИНАЧЕ %1
	|	КОНЕЦ", ПолеСтавки);

	Запрос.Текст = СтрЗаменить(Запрос.Текст, ПолеСтавки, ТекстШаблон);

КонецПроцедуры

&ИзменениеИКонтроль("СоответствующаяРасчетнаяСтавкаНДС")
Функция смарт_СоответствующаяРасчетнаяСтавкаНДС(СтавкаНДС)

	Если СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
		РасчетнаяСтавка = Перечисления.СтавкиНДС.НДС20_120;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС18 Тогда
		РасчетнаяСтавка = Перечисления.СтавкиНДС.НДС18_118;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
		РасчетнаяСтавка = Перечисления.СтавкиНДС.НДС10_110;
	#Вставка
	//++ #1744 смарт: Шляпников 19.12.2024 / УТ. Добавить ставки НДС 5% и 7%
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС5 Тогда
		РасчетнаяСтавка = Перечисления.СтавкиНДС.НДС5_105;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС7 Тогда
		РасчетнаяСтавка = Перечисления.СтавкиНДС.НДС7_107;
	//-- #1744 смарт: Шляпников 19.12.2024
	//++ #4804 смарт: Тимофеева 12.11.2025 / Добавить ставку НДС22
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС22 Тогда
		РасчетнаяСтавка = Перечисления.СтавкиНДС.НДС22_122;
	//-- #4804 смарт: Тимофеева 12.11.2025
	#КонецВставки
	Иначе
		РасчетнаяСтавка = СтавкаНДС;
	КонецЕсли;

	Возврат РасчетнаяСтавка;

КонецФункции

&ИзменениеИКонтроль("СформироватьЗапросКорректностьУказанияСтавкиНДСПродажи")
Процедура смарт_СформироватьЗапросКорректностьУказанияСтавкиНДСПродажи(ТекстЗапроса)

	ТекстЗапроса = ТекстЗапроса + СтрЗаменить(
	"ВЫБРАТЬ
	|	ВременнаяТаблицаТовары.НомерСтроки КАК НомерСтроки,
	|	ВременнаяТаблицаДокументПродажи.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаДокументПродажи.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|		КОГДА ВременнаяТаблицаДокументПродажи.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|				ИЛИ ВременнаяТаблицаДокументПродажи.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|		КОГДА ВременнаяТаблицаДокументПродажи.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДСУПокупателя)
	|			ТОГДА &СтавкаНДСПоУмолчанию
	|		КОГДА ВременнаяТаблицаДокументПродажи.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|			ТОГДА ВременнаяТаблицаТовары.Номенклатура.СтавкаНДС
	|	КОНЕЦ КАК СтавкаНДС
	|ИЗ
	|	ВременнаяТаблицаТовары КАК ВременнаяТаблицаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаДокументПродажи КАК ВременнаяТаблицаДокументПродажи
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ВременнаяТаблицаТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|					И &ВозвратМногооборотнойТары
	|				ТОГДА ЛОЖЬ
	|			КОГДА ВременнаяТаблицаДокументПродажи.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт)
	|					И ВременнаяТаблицаТовары.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|				ТОГДА ИСТИНА
	|			КОГДА ВременнаяТаблицаДокументПродажи.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДСУПокупателя)
	|					И ВременнаяТаблицаТовары.СтавкаНДС <> &СтавкаНДСПоУмолчанию
	|				ТОГДА ИСТИНА
	|			КОГДА (ВременнаяТаблицаДокументПродажи.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|					ИЛИ ВременнаяТаблицаДокументПродажи.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
	|					И ВременнаяТаблицаТовары.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|				ТОГДА ИСТИНА
	|			КОГДА ВременнаяТаблицаДокументПродажи.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|					И ВременнаяТаблицаТовары.СтавкаНДС <> ВременнаяТаблицаТовары.Номенклатура.СтавкаНДС
	|					И (ВременнаяТаблицаТовары.Номенклатура.СтавкаНДС В (
	|						ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10),
	|						 ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)))
	|				ТОГДА ИСТИНА
	|			КОГДА ВременнаяТаблицаДокументПродажи.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|					И ВременнаяТаблицаТовары.Номенклатура.СтавкаНДС В (
	|						ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18),
	#Вставка
	//++ #1744 смарт: Шляпников 19.12.2024 / УТ. Добавить ставки НДС 5% и 7%
	|						ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5),
	|						ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7),
	//-- #1744 смарт: Шляпников 19.12.2024
	//++ #4804 смарт: Тимофеева 12.11.2025 / Добавить ставку НДС22
	|						ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22),
	//-- #4804 смарт: Тимофеева 12.11.2025
	#КонецВставки
	|						ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20))
	|					И ВременнаяТаблицаТовары.СтавкаНДС НЕ В (
	|						ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18),
	#Вставка
	//++ #1744 смарт: Шляпников 19.12.2024 / УТ. Добавить ставки НДС 5% и 7%
	|						ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5),
	|						ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7),
	//-- #1744 смарт: Шляпников 19.12.2024
	//++ #4804 смарт: Тимофеева 12.11.2025 / Добавить ставку НДС22
	|						ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22),
	//-- #4804 смарт: Тимофеева 12.11.2025
	#КонецВставки
	|						ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20))
	|				ТОГДА ИСТИНА
	|			КОГДА ВременнаяТаблицаДокументПродажи.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|					И ВременнаяТаблицаТовары.Номенклатура.СтавкаНДС В (
	|						ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
	#Вставка
	//++ #1744 смарт: Шляпников 19.12.2024 / УТ. Добавить ставки НДС 5% и 7%
	|						ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5_105),
	|						ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7_107),
	//-- #1744 смарт: Шляпников 19.12.2024
	//++ #4804 смарт: Тимофеева 12.11.2025 / Добавить ставку НДС22
	|						ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22_122),
	//-- #4804 смарт: Тимофеева 12.11.2025
	#КонецВставки
	|						ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20_120))
	|					И ВременнаяТаблицаТовары.СтавкаНДС НЕ В (
	|						ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
	#Вставка
	//++ #1744 смарт: Шляпников 19.12.2024 / УТ. Добавить ставки НДС 5% и 7%
	|						ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5_105),
	|						ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7_107),
	//-- #1744 смарт: Шляпников 19.12.2024
	//++ #4804 смарт: Тимофеева 12.11.2025 / Добавить ставку НДС22
	|						ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22_122),
	//-- #4804 смарт: Тимофеева 12.11.2025
	#КонецВставки
	|						ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20_120))
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|;
	|", "&СтавкаНДСПоУмолчанию", УчетНДСРФ.ТекстВыбораСтавкиНДСПоУмолчанию(, Истина));

КонецПроцедуры

&ИзменениеИКонтроль("СформироватьЗапросКорректностьСуммыНДС")
Процедура смарт_СформироватьЗапросКорректностьСуммыНДС(ТекстЗапроса)

	ТекстЗапроса = ТекстЗапроса + "
	|ВЫБРАТЬ
	|	ВременнаяТаблицаТовары.НомерСтроки КАК НомерСтроки,
	|	ВременнаяТаблицаТовары.НоменклатураНабора КАК НоменклатураНабора,
	|	ВременнаяТаблицаТовары.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|	ВременнаяТаблицаТовары.СуммаНДС КАК СуммаНДС,
	|	ВременнаяТаблицаТовары.СтавкаНДС КАК СтавкаНДС,
	|	ВременнаяТаблицаДокументПродажи.Валюта КАК Валюта,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаДокументПродажи.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДСУПокупателя) ТОГДА
	|			ВЫБОР ВременнаяТаблицаТовары.СуммаНДС
	|				КОГДА 0 ТОГДА ЛОЖЬ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|		КОГДА ВременнаяТаблицаТовары.СтавкаНДС В (ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20), ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20_120)) ТОГДА
	|			ВЫБОР КОГДА ВременнаяТаблицаДокументПродажи.ЦенаВключаетНДС ТОГДА
	|               ВЫБОР ВременнаяТаблицаТовары.СуммаНДС - ВЫРАЗИТЬ((ВременнаяТаблицаТовары.Сумма * 0.20 /1.20) КАК ЧИСЛО(31,2))
	|					КОГДА 0 ТОГДА ЛОЖЬ
	|					КОГДА 0.01 ТОГДА ЛОЖЬ
	|					КОГДА -0.01 ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ	
	|			ИНАЧЕ
	|               ВЫБОР ВременнаяТаблицаТовары.СуммаНДС - ВЫРАЗИТЬ((ВременнаяТаблицаТовары.Сумма * 0.20) КАК ЧИСЛО(31,2))
	|					КОГДА 0 ТОГДА ЛОЖЬ
	|					КОГДА 0.01 ТОГДА ЛОЖЬ
	|					КОГДА -0.01 ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ	
	|			КОНЕЦ
	|		КОГДА ВременнаяТаблицаТовары.СтавкаНДС В (ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18), ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118)) ТОГДА
	|			ВЫБОР КОГДА ВременнаяТаблицаДокументПродажи.ЦенаВключаетНДС ТОГДА
	|               ВЫБОР ВременнаяТаблицаТовары.СуммаНДС - ВЫРАЗИТЬ((ВременнаяТаблицаТовары.Сумма * 0.18 /1.18) КАК ЧИСЛО(31,2))
	|					КОГДА 0 ТОГДА ЛОЖЬ
	|					КОГДА 0.01 ТОГДА ЛОЖЬ
	|					КОГДА -0.01 ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ	
	|			ИНАЧЕ
	|               ВЫБОР ВременнаяТаблицаТовары.СуммаНДС - ВЫРАЗИТЬ((ВременнаяТаблицаТовары.Сумма * 0.18) КАК ЧИСЛО(31,2))
	|					КОГДА 0 ТОГДА ЛОЖЬ
	|					КОГДА 0.01 ТОГДА ЛОЖЬ
	|					КОГДА -0.01 ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ	
	|			КОНЕЦ
	|		КОГДА ВременнаяТаблицаТовары.СтавкаНДС В (ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10), ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)) ТОГДА
	|			ВЫБОР КОГДА ВременнаяТаблицаДокументПродажи.ЦенаВключаетНДС ТОГДА
	|               ВЫБОР ВременнаяТаблицаТовары.СуммаНДС - ВЫРАЗИТЬ((ВременнаяТаблицаТовары.Сумма * 0.10 /1.10) КАК ЧИСЛО(31,2))
	|					КОГДА 0 ТОГДА ЛОЖЬ
	|					КОГДА 0.01 ТОГДА ЛОЖЬ
	|					КОГДА -0.01 ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ	
	|			ИНАЧЕ
	|               ВЫБОР ВременнаяТаблицаТовары.СуммаНДС - ВЫРАЗИТЬ((ВременнаяТаблицаТовары.Сумма * 0.10) КАК ЧИСЛО(31,2))
	|					КОГДА 0 ТОГДА ЛОЖЬ
	|					КОГДА 0.01 ТОГДА ЛОЖЬ
	|					КОГДА -0.01 ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ	
	|			КОНЕЦ
	#Вставка
	//++ #1744 смарт: Шляпников 19.12.2024 / УТ. Добавить ставки НДС 5% и 7%
	|		КОГДА ВременнаяТаблицаТовары.СтавкаНДС В (ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5), ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5_105)) ТОГДА
	|			ВЫБОР КОГДА ВременнаяТаблицаДокументПродажи.ЦенаВключаетНДС ТОГДА
	|               ВЫБОР ВременнаяТаблицаТовары.СуммаНДС - ВЫРАЗИТЬ((ВременнаяТаблицаТовары.Сумма * 0.05 /1.05) КАК ЧИСЛО(31,2))
	|					КОГДА 0 ТОГДА ЛОЖЬ
	|					КОГДА 0.01 ТОГДА ЛОЖЬ
	|					КОГДА -0.01 ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ	
	|			ИНАЧЕ
	|               ВЫБОР ВременнаяТаблицаТовары.СуммаНДС - ВЫРАЗИТЬ((ВременнаяТаблицаТовары.Сумма * 0.05) КАК ЧИСЛО(31,2))
	|					КОГДА 0 ТОГДА ЛОЖЬ
	|					КОГДА 0.01 ТОГДА ЛОЖЬ
	|					КОГДА -0.01 ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ	
	|			КОНЕЦ
	|		КОГДА ВременнаяТаблицаТовары.СтавкаНДС В (ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7), ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7_107)) ТОГДА
	|			ВЫБОР КОГДА ВременнаяТаблицаДокументПродажи.ЦенаВключаетНДС ТОГДА
	|               ВЫБОР ВременнаяТаблицаТовары.СуммаНДС - ВЫРАЗИТЬ((ВременнаяТаблицаТовары.Сумма * 0.07 /1.07) КАК ЧИСЛО(31,2))
	|					КОГДА 0 ТОГДА ЛОЖЬ
	|					КОГДА 0.01 ТОГДА ЛОЖЬ
	|					КОГДА -0.01 ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ	
	|			ИНАЧЕ
	|               ВЫБОР ВременнаяТаблицаТовары.СуммаНДС - ВЫРАЗИТЬ((ВременнаяТаблицаТовары.Сумма * 0.07) КАК ЧИСЛО(31,2))
	|					КОГДА 0 ТОГДА ЛОЖЬ
	|					КОГДА 0.01 ТОГДА ЛОЖЬ
	|					КОГДА -0.01 ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ	
	|			КОНЕЦ
	//-- #1744 смарт: Шляпников 19.12.2024
	//++ #4804 смарт: Тимофеева 12.11.2025 / Добавить ставку НДС22
	|		КОГДА ВременнаяТаблицаТовары.СтавкаНДС В (ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22), ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22_122)) ТОГДА
	|			ВЫБОР КОГДА ВременнаяТаблицаДокументПродажи.ЦенаВключаетНДС ТОГДА
	|               ВЫБОР ВременнаяТаблицаТовары.СуммаНДС - ВЫРАЗИТЬ((ВременнаяТаблицаТовары.Сумма * 0.22 /1.22) КАК ЧИСЛО(31,2))
	|					КОГДА 0 ТОГДА ЛОЖЬ
	|					КОГДА 0.01 ТОГДА ЛОЖЬ
	|					КОГДА -0.01 ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ	
	|			ИНАЧЕ
	|               ВЫБОР ВременнаяТаблицаТовары.СуммаНДС - ВЫРАЗИТЬ((ВременнаяТаблицаТовары.Сумма * 0.22) КАК ЧИСЛО(31,2))
	|					КОГДА 0 ТОГДА ЛОЖЬ
	|					КОГДА 0.01 ТОГДА ЛОЖЬ
	|					КОГДА -0.01 ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ	
	|			КОНЕЦ
	//-- #4804 смарт: Тимофеева 12.11.2025
	#КонецВставки
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ КАК ЕстьОшибкиСуммаНДС,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаДокументПродажи.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДСУПокупателя) ТОГДА
	|			0
	|		КОГДА ВременнаяТаблицаТовары.СтавкаНДС В (ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20), ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20_120)) ТОГДА
	|			ВЫБОР КОГДА ВременнаяТаблицаДокументПродажи.ЦенаВключаетНДС ТОГДА
	|				ВЫРАЗИТЬ((ВременнаяТаблицаТовары.Сумма * 0.20 /1.20) КАК ЧИСЛО(31,2))
	|			ИНАЧЕ
	|				ВЫРАЗИТЬ((ВременнаяТаблицаТовары.Сумма * 0.20) КАК ЧИСЛО(31,2))
	|			КОНЕЦ
	|		КОГДА ВременнаяТаблицаТовары.СтавкаНДС В (ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18), ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118)) ТОГДА
	|			ВЫБОР КОГДА ВременнаяТаблицаДокументПродажи.ЦенаВключаетНДС ТОГДА
	|				ВЫРАЗИТЬ((ВременнаяТаблицаТовары.Сумма * 0.18 /1.18) КАК ЧИСЛО(31,2))
	|			ИНАЧЕ
	|				ВЫРАЗИТЬ((ВременнаяТаблицаТовары.Сумма * 0.18) КАК ЧИСЛО(31,2))
	|			КОНЕЦ
	|		КОГДА ВременнаяТаблицаТовары.СтавкаНДС В (ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10), ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)) ТОГДА
	|			ВЫБОР КОГДА ВременнаяТаблицаДокументПродажи.ЦенаВключаетНДС  ТОГДА
	|				ВЫРАЗИТЬ((ВременнаяТаблицаТовары.Сумма * 0.10 /1.10) КАК ЧИСЛО(31,2))
	|			ИНАЧЕ
	|				ВЫРАЗИТЬ((ВременнаяТаблицаТовары.Сумма * 0.10) КАК ЧИСЛО(31,2))
	|			КОНЕЦ
	#Вставка
	//++ #1744 смарт: Шляпников 19.12.2024 / УТ. Добавить ставки НДС 5% и 7%
	|		КОГДА ВременнаяТаблицаТовары.СтавкаНДС В (ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5), ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5_105)) ТОГДА
	|			ВЫБОР КОГДА ВременнаяТаблицаДокументПродажи.ЦенаВключаетНДС  ТОГДА
	|				ВЫРАЗИТЬ((ВременнаяТаблицаТовары.Сумма * 0.05 /1.05) КАК ЧИСЛО(31,2))
	|			ИНАЧЕ
	|				ВЫРАЗИТЬ((ВременнаяТаблицаТовары.Сумма * 0.05) КАК ЧИСЛО(31,2))
	|			КОНЕЦ
	|		КОГДА ВременнаяТаблицаТовары.СтавкаНДС В (ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7), ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7_107)) ТОГДА
	|			ВЫБОР КОГДА ВременнаяТаблицаДокументПродажи.ЦенаВключаетНДС  ТОГДА
	|				ВЫРАЗИТЬ((ВременнаяТаблицаТовары.Сумма * 0.07 /1.07) КАК ЧИСЛО(31,2))
	|			ИНАЧЕ
	|				ВЫРАЗИТЬ((ВременнаяТаблицаТовары.Сумма * 0.07) КАК ЧИСЛО(31,2))
	|			КОНЕЦ
	//-- #1744 смарт: Шляпников 19.12.2024
	//++ #4804 смарт: Тимофеева 12.11.2025 / Добавить ставку НДС22
	|		КОГДА ВременнаяТаблицаТовары.СтавкаНДС В (ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22), ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22_122)) ТОГДА
	|			ВЫБОР КОГДА ВременнаяТаблицаДокументПродажи.ЦенаВключаетНДС ТОГДА
	|				ВЫРАЗИТЬ((ВременнаяТаблицаТовары.Сумма * 0.22 /1.22) КАК ЧИСЛО(31,2))
	|			ИНАЧЕ
	|				ВЫРАЗИТЬ((ВременнаяТаблицаТовары.Сумма * 0.22) КАК ЧИСЛО(31,2))
	|			КОНЕЦ
	//-- #4804 смарт: Тимофеева 12.11.2025
	#КонецВставки
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК СуммаНДСРасчетная
	|ИЗ
	|	ВременнаяТаблицаТовары КАК ВременнаяТаблицаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаДокументПродажи КАК ВременнаяТаблицаДокументПродажи
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаДокументПродажи.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДСУПокупателя) ТОГДА
	|			ВЫБОР ВременнаяТаблицаТовары.СуммаНДС
	|				КОГДА 0 ТОГДА ЛОЖЬ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|		КОГДА ВременнаяТаблицаТовары.СтавкаНДС В (ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20), ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20_120)) ТОГДА
	|			ВЫБОР КОГДА ВременнаяТаблицаДокументПродажи.ЦенаВключаетНДС ТОГДА
	|               ВЫБОР ВременнаяТаблицаТовары.СуммаНДС - ВЫРАЗИТЬ((ВременнаяТаблицаТовары.Сумма * 0.20 /1.20) КАК ЧИСЛО(31,2))
	|					КОГДА 0 ТОГДА ЛОЖЬ
	|					КОГДА 0.01 ТОГДА ЛОЖЬ
	|					КОГДА -0.01 ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ	
	|			ИНАЧЕ
	|               ВЫБОР ВременнаяТаблицаТовары.СуммаНДС - ВЫРАЗИТЬ((ВременнаяТаблицаТовары.Сумма * 0.20) КАК ЧИСЛО(31,2))
	|					КОГДА 0 ТОГДА ЛОЖЬ
	|					КОГДА 0.01 ТОГДА ЛОЖЬ
	|					КОГДА -0.01 ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ	
	|			КОНЕЦ
	|		КОГДА ВременнаяТаблицаТовары.СтавкаНДС В (ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18), ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118)) ТОГДА
	|			ВЫБОР КОГДА ВременнаяТаблицаДокументПродажи.ЦенаВключаетНДС ТОГДА
	|               ВЫБОР ВременнаяТаблицаТовары.СуммаНДС - ВЫРАЗИТЬ((ВременнаяТаблицаТовары.Сумма * 0.18 /1.18) КАК ЧИСЛО(31,2))
	|					КОГДА 0 ТОГДА ЛОЖЬ
	|					КОГДА 0.01 ТОГДА ЛОЖЬ
	|					КОГДА -0.01 ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ	
	|			ИНАЧЕ
	|               ВЫБОР ВременнаяТаблицаТовары.СуммаНДС - ВЫРАЗИТЬ((ВременнаяТаблицаТовары.Сумма * 0.18) КАК ЧИСЛО(31,2))
	|					КОГДА 0 ТОГДА ЛОЖЬ
	|					КОГДА 0.01 ТОГДА ЛОЖЬ
	|					КОГДА -0.01 ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ	
	|			КОНЕЦ
	|		КОГДА ВременнаяТаблицаТовары.СтавкаНДС В (ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10), ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)) ТОГДА
	|			ВЫБОР КОГДА ВременнаяТаблицаДокументПродажи.ЦенаВключаетНДС ТОГДА
	|               ВЫБОР ВременнаяТаблицаТовары.СуммаНДС - ВЫРАЗИТЬ((ВременнаяТаблицаТовары.Сумма * 0.10 /1.10) КАК ЧИСЛО(31,2))
	|					КОГДА 0 ТОГДА ЛОЖЬ
	|					КОГДА 0.01 ТОГДА ЛОЖЬ
	|					КОГДА -0.01 ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ	
	|			ИНАЧЕ
	|               ВЫБОР ВременнаяТаблицаТовары.СуммаНДС - ВЫРАЗИТЬ((ВременнаяТаблицаТовары.Сумма * 0.10) КАК ЧИСЛО(31,2))
	|					КОГДА 0 ТОГДА ЛОЖЬ
	|					КОГДА 0.01 ТОГДА ЛОЖЬ
	|					КОГДА -0.01 ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ	
	|			КОНЕЦ
	#Вставка
	//++ #1744 смарт: Шляпников 19.12.2024 / УТ. Добавить ставки НДС 5% и 7%
	|		КОГДА ВременнаяТаблицаТовары.СтавкаНДС В (ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5), ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5_105)) ТОГДА
	|			ВЫБОР КОГДА ВременнаяТаблицаДокументПродажи.ЦенаВключаетНДС ТОГДА
	|               ВЫБОР ВременнаяТаблицаТовары.СуммаНДС - ВЫРАЗИТЬ((ВременнаяТаблицаТовары.Сумма * 0.05 /1.05) КАК ЧИСЛО(31,2))
	|					КОГДА 0 ТОГДА ЛОЖЬ
	|					КОГДА 0.01 ТОГДА ЛОЖЬ
	|					КОГДА -0.01 ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ	
	|			ИНАЧЕ
	|               ВЫБОР ВременнаяТаблицаТовары.СуммаНДС - ВЫРАЗИТЬ((ВременнаяТаблицаТовары.Сумма * 0.05) КАК ЧИСЛО(31,2))
	|					КОГДА 0 ТОГДА ЛОЖЬ
	|					КОГДА 0.01 ТОГДА ЛОЖЬ
	|					КОГДА -0.01 ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ	
	|			КОНЕЦ
	|		КОГДА ВременнаяТаблицаТовары.СтавкаНДС В (ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7), ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7_107)) ТОГДА
	|			ВЫБОР КОГДА ВременнаяТаблицаДокументПродажи.ЦенаВключаетНДС ТОГДА
	|               ВЫБОР ВременнаяТаблицаТовары.СуммаНДС - ВЫРАЗИТЬ((ВременнаяТаблицаТовары.Сумма * 0.07 /1.07) КАК ЧИСЛО(31,2))
	|					КОГДА 0 ТОГДА ЛОЖЬ
	|					КОГДА 0.01 ТОГДА ЛОЖЬ
	|					КОГДА -0.01 ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ	
	|			ИНАЧЕ
	|               ВЫБОР ВременнаяТаблицаТовары.СуммаНДС - ВЫРАЗИТЬ((ВременнаяТаблицаТовары.Сумма * 0.07) КАК ЧИСЛО(31,2))
	|					КОГДА 0 ТОГДА ЛОЖЬ
	|					КОГДА 0.01 ТОГДА ЛОЖЬ
	|					КОГДА -0.01 ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ	
	|			КОНЕЦ
	//-- #1744 смарт: Шляпников 19.12.2024
	//++ #4804 смарт: Тимофеева 12.11.2025 / Добавить ставку НДС22
	|		КОГДА ВременнаяТаблицаТовары.СтавкаНДС В (ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22), ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22_122)) ТОГДА
	|			ВЫБОР КОГДА ВременнаяТаблицаДокументПродажи.ЦенаВключаетНДС ТОГДА
	|               ВЫБОР ВременнаяТаблицаТовары.СуммаНДС - ВЫРАЗИТЬ((ВременнаяТаблицаТовары.Сумма * 0.22 /1.22) КАК ЧИСЛО(31,2))
	|					КОГДА 0 ТОГДА ЛОЖЬ
	|					КОГДА 0.01 ТОГДА ЛОЖЬ
	|					КОГДА -0.01 ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ	
	|			ИНАЧЕ
	|               ВЫБОР ВременнаяТаблицаТовары.СуммаНДС - ВЫРАЗИТЬ((ВременнаяТаблицаТовары.Сумма * 0.22) КАК ЧИСЛО(31,2))
	|					КОГДА 0 ТОГДА ЛОЖЬ
	|					КОГДА 0.01 ТОГДА ЛОЖЬ
	|					КОГДА -0.01 ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ	
	|			КОНЕЦ
	//-- #4804 смарт: Тимофеева 12.11.2025
	#КонецВставки
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ
	|;
	|";

КонецПроцедуры

&ИзменениеИКонтроль("СформироватьЗапросКорректностьУказанияСтавкиНДСЗакупки")
Процедура смарт_СформироватьЗапросКорректностьУказанияСтавкиНДСЗакупки(ТекстЗапроса)

	ТекстЗапроса = ТекстЗапроса + СтрЗаменить(
	"ВЫБРАТЬ
	|	ВременнаяТаблицаТовары.НомерСтроки КАК НомерСтроки,
	|	ВременнаяТаблицаДокументЗакупки.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаДокументЗакупки.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|		КОГДА ВременнаяТаблицаДокументЗакупки.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|				ИЛИ ВременнаяТаблицаДокументЗакупки.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|		КОГДА ВременнаяТаблицаДокументЗакупки.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДСУПокупателя)
	|			ТОГДА &СтавкаНДСПоУмолчанию
	|		КОГДА ВременнаяТаблицаДокументЗакупки.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|			ТОГДА ВременнаяТаблицаТовары.Номенклатура.СтавкаНДС
	|	КОНЕЦ КАК СтавкаНДС
	|ИЗ
	|	ВременнаяТаблицаТовары КАК ВременнаяТаблицаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаДокументЗакупки КАК ВременнаяТаблицаДокументЗакупки
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ВременнаяТаблицаТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|					И &ВозвратМногооборотнойТары
	|				ТОГДА ЛОЖЬ
	|			КОГДА ВременнаяТаблицаДокументЗакупки.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт)
	|					И ВременнаяТаблицаТовары.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|				ТОГДА ИСТИНА
	|			КОГДА ВременнаяТаблицаДокументЗакупки.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДСУПокупателя)
	|					И ВременнаяТаблицаТовары.СтавкаНДС <> &СтавкаНДСПоУмолчанию
	|				ТОГДА ИСТИНА
	|			КОГДА (ВременнаяТаблицаДокументЗакупки.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|					ИЛИ ВременнаяТаблицаДокументЗакупки.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
	|					И ВременнаяТаблицаТовары.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|				ТОГДА ИСТИНА
	|			КОГДА ВременнаяТаблицаДокументЗакупки.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|					И ВременнаяТаблицаТовары.СтавкаНДС <> ВременнаяТаблицаТовары.Номенклатура.СтавкаНДС
	|					И (ВременнаяТаблицаТовары.Номенклатура.СтавкаНДС В (
	|						ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10),
	|						 ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)))
	|				ТОГДА ИСТИНА
	|			КОГДА ВременнаяТаблицаДокументЗакупки.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|					И ВременнаяТаблицаТовары.Номенклатура.СтавкаНДС В (
	|						ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18),
	#Вставка
	//++ #1744 смарт: Шляпников 19.12.2024 / УТ. Добавить ставки НДС 5% и 7%
	|						ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5),
	|						ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7),
	//-- #1744 смарт: Шляпников 19.12.2024
	//++ #4804 смарт: Тимофеева 12.11.2025 / Добавить ставку НДС22
	|						ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22),
	//-- #4804 смарт: Тимофеева 12.11.2025
	#КонецВставки
	|						ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20))
	|					И ВременнаяТаблицаТовары.СтавкаНДС НЕ В (
	|						ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18),
	#Вставка
	//++ #1744 смарт: Шляпников 19.12.2024 / УТ. Добавить ставки НДС 5% и 7%
	|						ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5),
	|						ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7),
	//-- #1744 смарт: Шляпников 19.12.2024
	//++ #4804 смарт: Тимофеева 12.11.2025 / Добавить ставку НДС22
	|						ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22),
	//-- #4804 смарт: Тимофеева 12.11.2025
	#КонецВставки
	|						ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20))
	|				ТОГДА ИСТИНА
	|			КОГДА ВременнаяТаблицаДокументЗакупки.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|					И ВременнаяТаблицаТовары.Номенклатура.СтавкаНДС В (
	|						ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
	#Вставка
	//++ #1744 смарт: Шляпников 19.12.2024 / УТ. Добавить ставки НДС 5% и 7%
	|						ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5_105),
	|						ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7_107),
	//-- #1744 смарт: Шляпников 19.12.2024
	//++ #4804 смарт: Тимофеева 12.11.2025 / Добавить ставку НДС22
	|						ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22_122),
	//-- #4804 смарт: Тимофеева 12.11.2025
	#КонецВставки
	|						ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20_120))
	|					И ВременнаяТаблицаТовары.СтавкаНДС НЕ В (
	|						ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
	#Вставка
	//++ #1744 смарт: Шляпников 19.12.2024 / УТ. Добавить ставки НДС 5% и 7%
	|						ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5_105),
	|						ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7_107),
	//-- #1744 смарт: Шляпников 19.12.2024
	//++ #4804 смарт: Тимофеева 12.11.2025 / Добавить ставку НДС22
	|						ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22_122),
	//-- #4804 смарт: Тимофеева 12.11.2025
	#КонецВставки
	|						ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20_120))
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|;
	|", "&СтавкаНДСПоУмолчанию", УчетНДСРФ.ТекстВыбораСтавкиНДСПоУмолчанию(, Истина));

КонецПроцедуры

#КонецОбласти
